
#Область СлужебныйПрограммныйИнтерфейс
Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты.ВТранзакции().УдалениеТестовыхДанных()
		.ДобавитьСерверныйТест("ЗаполнениеРеквизитовПоУмолчанию",,);

КонецПроцедуры

Процедура ЗаполнениеРеквизитовПоУмолчанию() Экспорт
	
	Организация = ЮТест.Данные().СоздатьЭлемент(Справочники.Организации);
	Склад = ЮТест.Данные().СоздатьЭлемент(Справочники.Склады);

	ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	ДокументОбъект.Заполнить(Неопределено);
	
	ЮТест.ОжидаетЧто(ДокументОбъект)
		.Свойство("Организация")
		.Заполнено()
		.Равно(Справочники.Организации.ОсновнаяОрганизация)
		.Свойство("Склад")
		.Равно(Справочники.Склады.ОсновнойСклад);
	
	ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	ЗначенияЗаполнения = Новый Структура("Организация, Склад", Организация, Склад);
	ДанныеЗаполнения = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ЮТест.ОжидаетЧто(ДокументОбъект)
		.Свойство("Организация")
		.Равно(Организация)
		.Свойство("Склад")
		.Равно(Склад);
	
КонецПроцедуры
#КонецОбласти
