#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ЮТЗапрос цен.
// 
// Параметры:
//  Товар - Строка - Товар
//  ТипЦены - Строка - Тип цены
// 
// Возвращаемое значение:
//  Произвольный - ЮТЗапрос цен
&Вместо("ЗапросЦен")
Функция ЮТЗапросЦен(Товар, ТипЦены) Экспорт
	
	// Собираем параметры в массив
	ПараметрыМетода = Мокито.МассивПараметров(Товар, ТипЦены);
	
	// Отправляем данные на анализ
	ПрерватьВыполнение = Ложь;
	Результат = Мокито.АнализВызова(РаботаСБД, "ЗапросЦен", ПараметрыМетода, ПрерватьВыполнение);
	
	// Обрабатываем результат анализа
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(Товар, ТипЦены);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
