#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Склад) Тогда
		Склад = Справочники.Склады.ОсновнойСклад;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли