#Если Сервер Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Экспортный прокси для тестирования неэкспортной процедуры
// 
// Параметры:
//  ИмяМетода - Строка - Полное имя метода
//  Параметры - Неопределено, Массив из Произвольный - Передаваемые параметры
//@skip-check extension-method-prefix
Процедура ВыполнитьПроцедуру(ИмяМетода, Параметры = Неопределено) Экспорт

	//@skip-check server-execution-safe-mode
	Выполнить(АК_ОбщегоНазначения.ТекстАлгоритма(ИмяМетода, Параметры));
	
КонецПроцедуры

// Экспортный прокси для тестирования неэкспортной функции
// 
// Параметры:
//  ИмяМетода - Строка - Полное имя метода
//  Параметры - Неопределено, Массив из Произвольный - Передаваемые параметры
//  ВозвращатьЗначение - Булево - Передаваемые параметры
// 
// Возвращаемое значение:
//  Произвольный - результат выполнения функции
//@skip-check extension-method-prefix
Функция ВыполнитьФункцию(ИмяМетода, Параметры = Неопределено) Экспорт

	//@skip-check server-execution-safe-mode
	Возврат Вычислить(АК_ОбщегоНазначения.ТекстАлгоритма(ИмяМетода, Параметры));
	
КонецФункции

#КонецОбласти

#КонецЕсли
