
#Область СлужебныйПрограммныйИнтерфейс
Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ДобавитьСерверныйТест("РасчетЗначенияСтавки", "Расчет значения ставки");

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура РасчетЗначенияСтавки() Экспорт
	
	ЮТест.ОжидаетЧто(РасчетНДС.ЗначениеСтавки(Перечисления.СтавкиНДС.НДС0))
		.ИмеетТип("Число")
		.Равно(0);
		
	ЮТест.ОжидаетЧто(РасчетНДС.ЗначениеСтавки(Перечисления.СтавкиНДС.НДС10))
		.ИмеетТип("Число")
		.Равно(10);

	ЮТест.ОжидаетЧто(РасчетНДС.ЗначениеСтавки(Перечисления.СтавкиНДС.НДС20))
		.ИмеетТип("Число")
		.Равно(20);
		
	ЮТест.ОжидаетЧто(РасчетНДС)
		.Метод("ЗначениеСтавки", ЮТОбщий.ЗначениеВМассиве(Неопределено))
		.ВыбрасываетИсключение("Ставка не поддерживается");
	
КонецПроцедуры
#КонецОбласти
